uFVM/tutorials/compressible/cylinder/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 100000;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }

    airfoil
    {
        type            zeroGradient;
    }

    topAndBottom
    {
        type            slip;
    }
    
    defaultPatches
    {
        type            empty;
    }
}

// ************************************************************************* //
