uFVM/tutorials/compressible/cylinder/0/h
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      h;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 125300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 125300;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 125300;
    }

    airfoil
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    topAndBottom
    {
        type            slip;
    }
    
    defaultPatches
    {
        type            empty;
    }
}


// ************************************************************************* //
